// Перетворити рядок на новий рядок,
// де кожен символ у новому рядку відповідає
// "(" якщо цей символ з'являється лише один раз у вихідному рядку
// або ")" якщо цей символ з'являється більше одного разу у вихідному рядку.
// Ігноруйте використання великих букв при визначенні дубліката символу.
// Приклади "din" => "((("; "recede" => "()()()"

function transform(str) {
  let result = '';



  
  return result;
}

console.log(transform('din')); // "((("
console.log(transform('recede')); // "()()()"